Tekla Open API Reference for Tekla Structures 2025
IntList Methods
The IntList type exposes the following members.
Methods
Name | Description
Add
 Adds a new integer to the end of the string list.
Contains
 Checks if the given integer is in the list.
GetRange
 Gets a sub-list of the integer list.
IndexOf(Int32)
 Gets the index of the specified integer.
IndexOf(Int32, Int32)
 Gets the index of the specified integer between the index to start the search from and the end of the list.
IndexOf(Int32, Int32, Int32)
 Gets the index of the specified integer between the index to start the search from and startIndex + count.
Insert
 Inserts the integer to the specified index.
IsEqual
 Compares the current object with an object of the same type.
LastIndexOf(Int32)
 Searches for the last occurence of the integer in the list.
LastIndexOf(Int32, Int32)
 Searches for the last occurence of the integer in the list.
LastIndexOf(Int32, Int32, Int32)
 Searches for the last occurence of the integer in the list.
Remove
 Removes the first occurence of the integer from the list.
RemoveRange
 Removes a range of items starting from the given index.
ToArray
 Copies the integers to an integer array.
Top
See Also
Reference
IntList Class
Tekla.Structures.Drawing Namespace